//---------------------------------------------------------------------------
//!	@file	precompile.h
//!	@brief	プレイコンパイルヘッダー
//---------------------------------------------------------------------------

#pragma once

//===========================================================================
//! ライブラリ関数
//===========================================================================
#include<iostream>
#include<string>
#include<fstream>
#include<vector>
#include<array>
#include <math.h>
#include <complex>

//===========================================================================
//! System
//===========================================================================
#include "DxLib.h"
#include "WinMain.h"
#include "GameMain.h"
#include "Input/KeyInput.h"
#include "Input/PadInput.h"
#include "Color.h"
#include "Effekseer.h"
#include "EffekseerForDXLib.h"

//===========================================================================
//! Base
//===========================================================================
#include "Base/Base.h"       //!< 全クラスのベース
#include "Base/EnemyBase.h"  //!< 敵のベース
#include "Base/PlayerBase.h" //!< プレイヤーのベース
#include "Base/Camera.h"     //!< カメラのベース

//===========================================================================
//! Manager
//===========================================================================
#include"Enemy/EnemyManager.h" //!< 敵のマネージャー

//===========================================================================
//! Game
//===========================================================================
#include "Camera/CameraPlayer.h" //!< プレイヤーのカメラ
#include "Map.h"                 //!< マップ
#include "Player/Player.h"       //!< プレイヤー
#include "Goal.h"                //!< ゴール
#include "Enemy/Enemy.h"         //!< エネミー
#include "Score.h"               //!< スコア
#include "Light.h"               //!< ライト
#include "SlashingEffect.h"      //!< エフェクト

//===========================================================================
//! Scene
//===========================================================================
#include "Scene/SceneRanking.h" //!< ランキングシーン
#include "Scene/SceneTitle.h"   //!< タイトルシーン
#include "Scene/SceneClear.h"   //!< クリアシーン

//===========================================================================
//! imgui
//===========================================================================
#include "ImGui/imgui.h"
#include "ImGui/imgui_impl_win32.h"
#include "ImGui/imgui_impl_dx11.h"
