//---------------------------------------------------------------------------
//!	@file	Score.h
//!	@brief	スコアの処理
//---------------------------------------------------------------------------
#pragma once
class Score : public Base
{   
public:
    Score();
    ~Score() = default;

    void Initialize();
    void Update();
    void ImGui();
    void Draw();

public:
    //-------------------------------------------------------------
    //!	@name	ゲッター
    //-------------------------------------------------------------

    //@{
    int getScore() const { return score; }
    //@}
    
    //-------------------------------------------------------------
    //!	@name	セッター
    //-------------------------------------------------------------

    //@{
    void setEnemyScore(int enemyScore_) { score += enemyScore_; }
    //@}

private:
    int count; //!< 経過時間の計測
    int score; //!< スコア
};

