//---------------------------------------------------------------------------
//!	@file	Enemy.cpp
//!	@brief	蝙蝠の敵
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//! コンストラクター
//---------------------------------------------------------------------------
Enemy::Enemy()
{
	//! エネミーのサイズ
	EnemyMat.m[0][0] = ENEMY_SIZE;
	EnemyMat.m[1][1] = ENEMY_SIZE;
	EnemyMat.m[2][2] = ENEMY_SIZE;

	Initialize();
}

//---------------------------------------------------------------------------
//! デストラクター
//---------------------------------------------------------------------------
Enemy::~Enemy()
{
	MV1DeleteModel(modelBat);
}

//---------------------------------------------------------------------------
//! 初期化処理
//---------------------------------------------------------------------------
void Enemy::Initialize()
{
	isImGui = false;
	isAttackHit = false;
	//! modelBatにモデルをセット
	modelBat = MV1LoadModel("data/enemy/enemy.mv1");

	//! エネミーをランダム配置
	RandPos();

	//! 3Dモデルを移動する行列のセット
	MV1SetMatrix(modelBat, EnemyMat);
}

//---------------------------------------------------------------------------
//! 更新処理（中身なし）
//---------------------------------------------------------------------------
void Enemy::Update()
{
}

//---------------------------------------------------------------------------
//! 描画処理
//---------------------------------------------------------------------------
void Enemy::Draw()
{
	float enemyR = 5.0f;

	if (isEnableDebug) {
		//! 敵の当たり判定のサイズ
		DrawSphere3D(pos = VGet(pos.x, ENEMY_Y, pos.z), enemyR, 10, RED, RED, false);
	}

	if (!isAttackHit) {
		MV1DrawModel(modelBat);
	}
}