//---------------------------------------------------------------------------
//!	@file	Base.cpp
//!	@brief	全クラスのベース
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//! コンストラクター
//---------------------------------------------------------------------------
Base::Base()
{
	pos = {0.0f, 0.0f, 0.0f};

	hitSize = 10;
	isImGui = false;
	isEnableDebug = false;
}

//---------------------------------------------------------------------------
//! Imguiを開くと閉じる
//---------------------------------------------------------------------------
void Base::OpenAndCloseImGui()
{
	//! @retval true imguiを開く
	if ((GetMouseInput() & MOUSE_INPUT_LEFT)) {
		isImGui = true;
	}
	//! @retval false imguiを閉じる
	else if ((GetMouseInput() & MOUSE_INPUT_RIGHT)) {
		isImGui = false;
	}
}
